aalib
abseil-cpp
accounts-qml-module
accountsservice
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
aha
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
amd-ucode
aom
appstream
appstream-qt
aquamarine
archlinux-appstream-data
archlinux-keyring
argon2
ark
at-spi2-core
atkmm
attica
attr
audit
aurorae
auto-cpufreq
autoconf
automake
avahi
ayatana-ido
babl
baloo
baloo-widgets
base
base-devel
bash
bibata-cursor-theme
binutils
bison
blas
bluedevil
bluez
bluez-libs
bluez-qt
bluez-utils
bolt
boost-libs
breeze
breeze-gtk
breeze-icons
brightnessctl
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cbindgen
cblas
cdparanoia
cifs-utils
clang
clinfo
clucene
code
compiler-rt
composefs
convertlit
coreutils
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
ddcutil
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
discord
discount
discover
dmidecode
dolphin
double-conversion
drkonqi
duktape
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efivar
electron35
electron37
electron38
electron39
elfutils
ell
eww
eww-debug
exiv2
exo
expat
fakeroot
fastfetch
fd
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
firefox
flac
flatpak
flatpak-kcm
flex
fmt
fontconfig
fprintd
frameworkintegration
freeglut
freerdp
freetype2
fribidi
fuse-common
fuse2
fuse3
gawk
gc
gcc
gcc-libs
gcr-4
gdb
gdb-common
gdbm
gdk-pixbuf2
gegl
gettext
ghostty
ghostty-shell-integration
ghostty-terminfo
giflib
gimp
git
glib-networking
glib2
glibc
glibmm
glslang
glu
glycin
gmp
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
go
gobject-introspection
gobject-introspection-runtime
gocryptfs
gperftools
gpgme
gpgmepp
gpm
gpsd
granite7
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gssdp
gst-plugin-pipewire
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtk4-layer-shell
gtkmm3
guile
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
highway
htop
hunspell
hwdata
hwloc
hyphen
hyprcursor
hyprgraphics
hypridle
hyprland
hyprland-guiutils
hyprland-qt-support
hyprlang
hyprlock
hyprpanel
hyprshot
hyprtoolkit
hyprutils
hyprwayland-scanner
i2c-tools
iana-etc
icu
imagemagick
imake
imath
iniparser
intel-gmmlib
intel-media-driver
iproute2
iptables
iputils
iso-codes
iw
iwd
jansson
jasper
jbigkit
jp2a
jq
json-c
json-glib
jsoncpp
kaccounts-integration
kactivitymanagerd
karchive
kate
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdecoration
kded
kdeplasma-addons
kdesu
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kglobalaccel
kglobalacceld
kguiaddons
kholidays
ki18n
kiconthemes
kidletime
kimageformats
kinfocenter
kio
kio-extras
kio-fuse
kirigami
kirigami-addons
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmenuedit
kmod
knewstuff
knighttime
knotifications
knotifyconfig
konsole
kpackage
kparts
kpipewire
kpty
kquickcharts
krb5
krdp
krunner
kscreen
kscreenlocker
kservice
ksshaskpass
kstatusnotifieritem
ksvg
ksystemstats
ktexteditor
ktextwidgets
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwayland
kwidgetsaddons
kwin
kwindowsystem
kwrited
kxmlgui
l-smash
lame
lapack
layer-shell-qt
lcms2
ldb
leancrypto
lensfun
lib32-alsa-lib
lib32-alsa-plugins
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdisplay-info
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnm
lib32-libnsl
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-asahi
lib32-vulkan-icd-loader
lib32-vulkan-mesa-implicit-layers
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaccounts-glib
libaccounts-qt
libadwaita
libappindicator
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdr
libcloudproviders
libcmis
libcolord
libcups
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libde265
libdecor
libdeflate
libdisplay-info
libdmtx
libdovi
libdrm
libdvdnav
libdvdread
libe-book
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfprint
libfreeaptx
libfreehand
libfyaml
libgcrypt
libgee
libgexiv2
libgirepository
libglvnd
libgpg-error
libgtop
libgudev
libgusb
libheif
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libixion
libjpeg-turbo
libjxl
libkexiv2
libksba
libkscreen
libksysguard
liblangtag
liblc3
libldac
libldap
libliftoff
liblqr
libluv
libmakepkg-dropins
libmalcontent
libmbim
libmd
libmfx
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpdclient
libmspub
libmtp
libmwaw
libmypaint
libmysofa
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpcap
libpciaccess
libpgm
libpipewire
libplacebo
libplasma
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient-qt6
libqalculate
libqmi
libqrtr-glib
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspiro
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libva-intel-driver
libvdpau
libverto
libvisio
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwmf
libwpd
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld
llvm
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51-lpeg
luajit
lv2
lz4
lzo
m4
mailcap
make
md4c
mdadm
media-player-info
mesa
mesa-utils
milou
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpdecimal
mpfr
mpg123
msgpack-c
mtdev
mypaint-brushes1
nano
nasm
ncurses
neon
neovim
nettle
network-manager-applet
networkmanager
networkmanager-dmenu
networkmanager-qt
nm-connection-editor
nmctl
nmctl-debug
node-gyp
nodejs
nodejs-nopt
nordvpn-bin
nordvpn-bin-debug
noto-fonts
noto-fonts-emoji
npth
nspr
nss
nvm
obsidian
ocean-sound-theme
ocl-icd
onetbb
oniguruma
opencore-amr
opencv
openexr
openh264
openjpeg2
openssh
openssl
openxr
opus
orc
ostree
otf-font-awesome
oxygen
oxygen-sounds
p11-kit
pacman
pacman-mirrorlist
pam
pambase
pango
pangomm
parted
patch
pciutils
pcre
pcre2
pcsclite
pear-desktop
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
plasma-activities
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-integration
plasma-meta
plasma-nm
plasma-pa
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace
plasma-workspace-wallpapers
plasma5support
playerctl
pnpm
polkit
polkit-kde-agent
polkit-qt6
poppler
poppler-data
poppler-glib
poppler-qt6
popt
portaudio
power-profiles-daemon
powerdevil
powertop
ppp
pps-tools
print-manager
prison
procps-ng
protobuf
psmisc
pugixml
pulseaudio-qt
purpose
python
python-autocommand
python-certifi
python-charset-normalizer
python-click
python-distro
python-gobject
python-idna
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-packaging
python-platformdirs
python-psutil
python-pyasyncore
python-pygdbmi
python-pyinotify
python-pywal16
python-requests
python-sentry_sdk
python-setuptools
python-urllib3
python-urwid
python-wcwidth
python-wheel
qca-qt6
qcoro
qqc2-breeze-style
qqc2-desktop-style
qrencode
qt6-5compat
qt6-base
qt6-declarative
qt6-imageformats
qt6-location
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-positioning
qt6-quick3d
qt6-quicktimeline
qt6-sensors
qt6-shadertools
qt6-speech
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-webchannel
qt6-webengine
qt6-websockets
qt6-webview
qt6ct
qtkeychain-qt6
raptor
rasqal
rav1e
re2
readline
redland
ripgrep
ripgrep-all
rofi
rsync
rtkit
rubberband
rust
sbc
sdbus-cpp
sddm
sddm-kcm
sdl2-compat
sdl2_ttf
sdl3
sdl3_ttf
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
simdjson
slang
slurp
smartmontools
smbclient
snappy
sndio
socat
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
source-highlight
spdlog
spectacle
speex
speexdsp
spicetify-cli
spicetify-cli-debug
spirv-tools
spotify
sqlite
sratom
srt
starship
startup-notification
steam
sudo
suitesparse
svt-av1
swaync
swww
syndication
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tdb
tevent
texinfo
thunar
tinysparql
tomlplusplus
tpm2-tss
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-firacode-nerd
ttf-hack
ttf-hack-nerd
ttf-jetbrains-mono-git
ttf-jetbrains-mono-nerd
ttf-ms-fonts
ttf-nerd-fonts-symbols-common
ttf-nerd-fonts-symbols-mono
ttf-roboto
tzdata
udisks2
unibilium
unzip
upower
usbutils
util-linux
util-linux-libs
v4l-utils
vapoursynth
verdict
vid.stab
vim
vim-runtime
vmaf
volume_key
vulkan-asahi
vulkan-icd-loader
vulkan-intel
vulkan-mesa-implicit-layers
vulkan-nouveau
vulkan-radeon
vulkan-tools
wasi-compiler-rt
wasi-libc
wasi-libc++
wasi-libc++abi
waybar
wayland
wayland-protocols
wayland-utils
webrtc-audio-processing-1
wget
which
wireguard-tools
wireless_tools
wireplumber
wl-clipboard
woff2-font-awesome
wofi
wpa_supplicant
x264
x265
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xf86-video-nouveau
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-server-xvfb
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xkbcomp
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xwayland
xorgproto
xsettingsd
xvidcore
xxhash
xz
yasm
yay
yay-debug
yyjson
zen-browser-bin
zenity
zeromq
zimg
zip
zix
zlib
zlib-ng
zram-generator
zstd
zxing-cpp
