amd-ucode
ark
auto-cpufreq
base
base-devel
bibata-cursor-theme
bluez
bluez-utils
brightnessctl
btrfs-progs
code
discord
dolphin
efibootmgr
eww
fastfetch
fd
firefox
fprintd
ghostty
gimp
git
grub
gsfonts
gst-plugin-pipewire
htop
hypridle
hyprland
hyprlock
hyprpanel
hyprshot
intel-media-driver
iw
iwd
jp2a
kate
kitty
konsole
libpulse
libreoffice-fresh
libva-intel-driver
linux
linux-firmware
nano
neovim
network-manager-applet
networkmanager
networkmanager-dmenu
nmctl
nordvpn-bin
obsidian
otf-font-awesome
pear-desktop
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
plasma-meta
plasma-workspace
power-profiles-daemon
powertop
python-pywal16
qt6ct
rofi
smartmontools
sof-firmware
spicetify-cli
spotify
starship
steam
swaync
swww
thunar
ttf-firacode-nerd
ttf-hack-nerd
ttf-jetbrains-mono-git
ttf-jetbrains-mono-nerd
ttf-ms-fonts
ttf-nerd-fonts-symbols-mono
ttf-roboto
vim
vulkan-intel
vulkan-nouveau
vulkan-radeon
waybar
wget
wireless_tools
wireplumber
woff2-font-awesome
wofi
xdg-utils
xf86-video-amdgpu
xf86-video-ati
xf86-video-nouveau
xorg-xinit
yay
yay-debug
zen-browser-bin
zram-generator
